balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA310.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNEN5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNEN5" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN64IE" edc:desc="" edc:mask="0x1" edc:name="CN64IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN65IE" edc:desc="" edc:mask="0x1" edc:name="CN65IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN66IE" edc:desc="" edc:mask="0x1" edc:name="CN66IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN67IE" edc:desc="" edc:mask="0x1" edc:name="CN67IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN68IE" edc:desc="" edc:mask="0x1" edc:name="CN68IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN69IE" edc:desc="" edc:mask="0x1" edc:name="CN69IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN70IE" edc:desc="" edc:mask="0x1" edc:name="CN70IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN71IE" edc:desc="" edc:mask="0x1" edc:name="CN71IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN72IE" edc:desc="" edc:mask="0x1" edc:name="CN72IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN73IE" edc:desc="" edc:mask="0x1" edc:name="CN73IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN74IE" edc:desc="" edc:mask="0x1" edc:name="CN74IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN75IE" edc:desc="" edc:mask="0x1" edc:name="CN75IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN76IE" edc:desc="" edc:mask="0x1" edc:name="CN76IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN77IE" edc:desc="" edc:mask="0x1" edc:name="CN77IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN78IE" edc:desc="" edc:mask="0x1" edc:name="CN78IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN79IE" edc:desc="" edc:mask="0x1" edc:name="CN79IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="CNEN6" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000" edc:name="CNEN6" edc:nzwidth="0x10" edc:por="-----------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN80IE" edc:desc="" edc:mask="0x1" edc:name="CN80IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN81IE" edc:desc="" edc:mask="0x1" edc:name="CN81IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN82IE" edc:desc="" edc:mask="0x1" edc:name="CN82IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN83IE" edc:desc="" edc:mask="0x1" edc:name="CN83IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN84IE" edc:desc="" edc:mask="0x1" edc:name="CN84IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnn--" edc:cname="CNPU1" edc:desc="" edc:impl="0xfffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000--" edc:name="CNPU1" edc:nzwidth="0x10" edc:por="00000000000000--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN2PUE" edc:desc="" edc:mask="0x1" edc:name="CN2PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN3PUE" edc:desc="" edc:mask="0x1" edc:name="CN3PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN4PUE" edc:desc="" edc:mask="0x1" edc:name="CN4PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN5PUE" edc:desc="" edc:mask="0x1" edc:name="CN5PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN6PUE" edc:desc="" edc:mask="0x1" edc:name="CN6PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN7PUE" edc:desc="" edc:mask="0x1" edc:name="CN7PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN8PUE" edc:desc="" edc:mask="0x1" edc:name="CN8PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN9PUE" edc:desc="" edc:mask="0x1" edc:name="CN9PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN10PUE" edc:desc="" edc:mask="0x1" edc:name="CN10PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN11PUE" edc:desc="" edc:mask="0x1" edc:name="CN11PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN12PUE" edc:desc="" edc:mask="0x1" edc:name="CN12PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN13PUE" edc:desc="" edc:mask="0x1" edc:name="CN13PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN14PUE" edc:desc="" edc:mask="0x1" edc:name="CN14PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN15PUE" edc:desc="" edc:mask="0x1" edc:name="CN15PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPU2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPU2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16PUE" edc:desc="" edc:mask="0x1" edc:name="CN16PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN17PUE" edc:desc="" edc:mask="0x1" edc:name="CN17PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN18PUE" edc:desc="" edc:mask="0x1" edc:name="CN18PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN19PUE" edc:desc="" edc:mask="0x1" edc:name="CN19PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN20PUE" edc:desc="" edc:mask="0x1" edc:name="CN20PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN21PUE" edc:desc="" edc:mask="0x1" edc:name="CN21PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN22PUE" edc:desc="" edc:mask="0x1" edc:name="CN22PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN23PUE" edc:desc="" edc:mask="0x1" edc:name="CN23PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN24PUE" edc:desc="" edc:mask="0x1" edc:name="CN24PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN25PUE" edc:desc="" edc:mask="0x1" edc:name="CN25PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN26PUE" edc:desc="" edc:mask="0x1" edc:name="CN26PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN27PUE" edc:desc="" edc:mask="0x1" edc:name="CN27PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN28PUE" edc:desc="" edc:mask="0x1" edc:name="CN28PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN29PUE" edc:desc="" edc:mask="0x1" edc:name="CN29PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN30PUE" edc:desc="" edc:mask="0x1" edc:name="CN30PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN31PUE" edc:desc="" edc:mask="0x1" edc:name="CN31PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
