balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA310.PIC
        <edc:SFRDef edc:access="-----------n----" edc:cname="ANSC" edc:desc="" edc:impl="0x9f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------1----" edc:name="ANSC" edc:nzwidth="0x10" edc:por="-----------1----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSC4" edc:desc="" edc:mask="0x1" edc:name="ANSC4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nn--nn------" edc:cname="ANSD" edc:desc="" edc:impl="0x9f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----11--11------" edc:name="ANSD" edc:nzwidth="0x10" edc:por="----11--11------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ANSD6" edc:desc="" edc:mask="0x1" edc:name="ANSD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSD7" edc:desc="" edc:mask="0x1" edc:name="ANSD7" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSD10" edc:desc="" edc:mask="0x1" edc:name="ANSD10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSD11" edc:desc="" edc:mask="0x1" edc:name="ANSD11" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------n-nnnn----" edc:cname="ANSE" edc:desc="" edc:impl="0x9ff0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------1-1111----" edc:name="ANSE" edc:nzwidth="0x10" edc:por="------1-1111----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSE4" edc:desc="" edc:mask="0x1" edc:name="ANSE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSE5" edc:desc="" edc:mask="0x1" edc:name="ANSE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSE6" edc:desc="" edc:mask="0x1" edc:name="ANSE6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSE7" edc:desc="" edc:mask="0x1" edc:name="ANSE7" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSE9" edc:desc="" edc:mask="0x1" edc:name="ANSE9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="------nnnn------" edc:cname="ANSG" edc:desc="" edc:impl="0x9f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------1111------" edc:name="ANSG" edc:nzwidth="0x10" edc:por="------1111------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ANSG6" edc:desc="" edc:mask="0x1" edc:name="ANSG6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSG7" edc:desc="" edc:mask="0x1" edc:name="ANSG7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSG8" edc:desc="" edc:mask="0x1" edc:name="ANSG8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSG9" edc:desc="" edc:mask="0x1" edc:name="ANSG9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="146"/>
        <edc:SFRDef edc:access="n---------nnnnnn" edc:cname="LCDREG" edc:desc="" edc:impl="0x803f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---------000000" edc:name="LCDREG" edc:nzwidth="16" edc:por="0---------000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKSEL" edc:desc="" edc:mask="0x3" edc:name="CKSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="MODE13" edc:desc="" edc:mask="0x1" edc:name="MODE13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BIAS" edc:desc="" edc:mask="0x7" edc:name="BIAS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="CPEN" edc:desc="" edc:mask="0x1" edc:name="CPEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CKSEL0" edc:desc="" edc:mask="0x1" edc:name="CKSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKSEL1" edc:desc="" edc:mask="0x1" edc:name="CKSEL1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BIAS0" edc:desc="" edc:mask="0x1" edc:name="BIAS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BIAS1" edc:desc="" edc:mask="0x1" edc:name="BIAS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BIAS2" edc:desc="" edc:mask="0x1" edc:name="BIAS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
