balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA310.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA13" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA13" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S16C3" edc:desc="" edc:mask="0x1" edc:name="S16C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C3" edc:desc="" edc:mask="0x1" edc:name="S17C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C3" edc:desc="" edc:mask="0x1" edc:name="S18C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C3" edc:desc="" edc:mask="0x1" edc:name="S19C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C3" edc:desc="" edc:mask="0x1" edc:name="S20C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C3" edc:desc="" edc:mask="0x1" edc:name="S21C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C3" edc:desc="" edc:mask="0x1" edc:name="S22C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C3" edc:desc="" edc:mask="0x1" edc:name="S23C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S24C3" edc:desc="" edc:mask="0x1" edc:name="S24C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C3" edc:desc="" edc:mask="0x1" edc:name="S25C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C3" edc:desc="" edc:mask="0x1" edc:name="S26C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C3" edc:desc="" edc:mask="0x1" edc:name="S27C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C3" edc:desc="" edc:mask="0x1" edc:name="S28C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C3" edc:desc="" edc:mask="0x1" edc:name="S29C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C3" edc:desc="" edc:mask="0x1" edc:name="S30C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C3" edc:desc="" edc:mask="0x1" edc:name="S31C3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA14" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA14" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S32C3" edc:desc="" edc:mask="0x1" edc:name="S32C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S33C3" edc:desc="" edc:mask="0x1" edc:name="S33C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S34C3" edc:desc="" edc:mask="0x1" edc:name="S34C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S35C3" edc:desc="" edc:mask="0x1" edc:name="S35C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S36C3" edc:desc="" edc:mask="0x1" edc:name="S36C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S37C3" edc:desc="" edc:mask="0x1" edc:name="S37C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S38C3" edc:desc="" edc:mask="0x1" edc:name="S38C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S39C3" edc:desc="" edc:mask="0x1" edc:name="S39C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S40C3" edc:desc="" edc:mask="0x1" edc:name="S40C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S41C3" edc:desc="" edc:mask="0x1" edc:name="S41C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S42C3" edc:desc="" edc:mask="0x1" edc:name="S42C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S43C3" edc:desc="" edc:mask="0x1" edc:name="S43C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S44C3" edc:desc="" edc:mask="0x1" edc:name="S44C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S45C3" edc:desc="" edc:mask="0x1" edc:name="S45C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S46C3" edc:desc="" edc:mask="0x1" edc:name="S46C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S47C3" edc:desc="" edc:mask="0x1" edc:name="S47C3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA15" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA15" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S48C3" edc:desc="" edc:mask="0x1" edc:name="S48C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S49C3" edc:desc="" edc:mask="0x1" edc:name="S49C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S50C3" edc:desc="" edc:mask="0x1" edc:name="S50C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S51C3" edc:desc="" edc:mask="0x1" edc:name="S51C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S52C3" edc:desc="" edc:mask="0x1" edc:name="S52C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S53C3" edc:desc="" edc:mask="0x1" edc:name="S53C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S54C3" edc:desc="" edc:mask="0x1" edc:name="S54C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S55C3" edc:desc="" edc:mask="0x1" edc:name="S55C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S56C3" edc:desc="" edc:mask="0x1" edc:name="S56C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S57C3" edc:desc="" edc:mask="0x1" edc:name="S57C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S58C3" edc:desc="" edc:mask="0x1" edc:name="S58C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S59C3" edc:desc="" edc:mask="0x1" edc:name="S59C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S60C3" edc:desc="" edc:mask="0x1" edc:name="S60C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S61C3" edc:desc="" edc:mask="0x1" edc:name="S61C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S62C3" edc:desc="" edc:mask="0x1" edc:name="S62C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S63C3" edc:desc="" edc:mask="0x1" edc:name="S63C3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA16" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA16" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S00C4" edc:desc="" edc:mask="0x1" edc:name="S00C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C4" edc:desc="" edc:mask="0x1" edc:name="S01C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C4" edc:desc="" edc:mask="0x1" edc:name="S02C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C4" edc:desc="" edc:mask="0x1" edc:name="S03C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C4" edc:desc="" edc:mask="0x1" edc:name="S04C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C4" edc:desc="" edc:mask="0x1" edc:name="S05C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C4" edc:desc="" edc:mask="0x1" edc:name="S06C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C4" edc:desc="" edc:mask="0x1" edc:name="S07C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S08C4" edc:desc="" edc:mask="0x1" edc:name="S08C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C4" edc:desc="" edc:mask="0x1" edc:name="S09C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C4" edc:desc="" edc:mask="0x1" edc:name="S10C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C4" edc:desc="" edc:mask="0x1" edc:name="S11C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C4" edc:desc="" edc:mask="0x1" edc:name="S12C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C4" edc:desc="" edc:mask="0x1" edc:name="S13C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C4" edc:desc="" edc:mask="0x1" edc:name="S14C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C4" edc:desc="" edc:mask="0x1" edc:name="S15C4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA17" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA17" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S16C4" edc:desc="" edc:mask="0x1" edc:name="S16C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C4" edc:desc="" edc:mask="0x1" edc:name="S17C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C4" edc:desc="" edc:mask="0x1" edc:name="S18C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C4" edc:desc="" edc:mask="0x1" edc:name="S19C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C4" edc:desc="" edc:mask="0x1" edc:name="S20C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C4" edc:desc="" edc:mask="0x1" edc:name="S21C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C4" edc:desc="" edc:mask="0x1" edc:name="S22C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C4" edc:desc="" edc:mask="0x1" edc:name="S23C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S24C4" edc:desc="" edc:mask="0x1" edc:name="S24C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C4" edc:desc="" edc:mask="0x1" edc:name="S25C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C4" edc:desc="" edc:mask="0x1" edc:name="S26C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C4" edc:desc="" edc:mask="0x1" edc:name="S27C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C4" edc:desc="" edc:mask="0x1" edc:name="S28C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C4" edc:desc="" edc:mask="0x1" edc:name="S29C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C4" edc:desc="" edc:mask="0x1" edc:name="S30C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C4" edc:desc="" edc:mask="0x1" edc:name="S31C4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA18" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA18" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S32C4" edc:desc="" edc:mask="0x1" edc:name="S32C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S33C4" edc:desc="" edc:mask="0x1" edc:name="S33C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S34C4" edc:desc="" edc:mask="0x1" edc:name="S34C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S35C4" edc:desc="" edc:mask="0x1" edc:name="S35C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S36C4" edc:desc="" edc:mask="0x1" edc:name="S36C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S37C4" edc:desc="" edc:mask="0x1" edc:name="S37C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S38C4" edc:desc="" edc:mask="0x1" edc:name="S38C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S39C4" edc:desc="" edc:mask="0x1" edc:name="S39C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S40C4" edc:desc="" edc:mask="0x1" edc:name="S40C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S41C4" edc:desc="" edc:mask="0x1" edc:name="S41C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S42C4" edc:desc="" edc:mask="0x1" edc:name="S42C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S43C4" edc:desc="" edc:mask="0x1" edc:name="S43C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S44C4" edc:desc="" edc:mask="0x1" edc:name="S44C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S45C4" edc:desc="" edc:mask="0x1" edc:name="S45C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S46C4" edc:desc="" edc:mask="0x1" edc:name="S46C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S47C4" edc:desc="" edc:mask="0x1" edc:name="S47C4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA19" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA19" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S48C4" edc:desc="" edc:mask="0x1" edc:name="S48C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S49C4" edc:desc="" edc:mask="0x1" edc:name="S49C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S50C4" edc:desc="" edc:mask="0x1" edc:name="S50C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S51C4" edc:desc="" edc:mask="0x1" edc:name="S51C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S52C4" edc:desc="" edc:mask="0x1" edc:name="S52C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S53C4" edc:desc="" edc:mask="0x1" edc:name="S53C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S54C4" edc:desc="" edc:mask="0x1" edc:name="S54C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S55C4" edc:desc="" edc:mask="0x1" edc:name="S55C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S56C4" edc:desc="" edc:mask="0x1" edc:name="S56C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S57C4" edc:desc="" edc:mask="0x1" edc:name="S57C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S58C4" edc:desc="" edc:mask="0x1" edc:name="S58C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S59C4" edc:desc="" edc:mask="0x1" edc:name="S59C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S60C4" edc:desc="" edc:mask="0x1" edc:name="S60C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S61C4" edc:desc="" edc:mask="0x1" edc:name="S61C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S62C4" edc:desc="" edc:mask="0x1" edc:name="S62C4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S63C4" edc:desc="" edc:mask="0x1" edc:name="S63C4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA20" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA20" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S00C5" edc:desc="" edc:mask="0x1" edc:name="S00C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C5" edc:desc="" edc:mask="0x1" edc:name="S01C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C5" edc:desc="" edc:mask="0x1" edc:name="S02C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C5" edc:desc="" edc:mask="0x1" edc:name="S03C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C5" edc:desc="" edc:mask="0x1" edc:name="S04C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C5" edc:desc="" edc:mask="0x1" edc:name="S05C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C5" edc:desc="" edc:mask="0x1" edc:name="S06C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C5" edc:desc="" edc:mask="0x1" edc:name="S07C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S08C5" edc:desc="" edc:mask="0x1" edc:name="S08C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C5" edc:desc="" edc:mask="0x1" edc:name="S09C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C5" edc:desc="" edc:mask="0x1" edc:name="S10C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C5" edc:desc="" edc:mask="0x1" edc:name="S11C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C5" edc:desc="" edc:mask="0x1" edc:name="S12C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C5" edc:desc="" edc:mask="0x1" edc:name="S13C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C5" edc:desc="" edc:mask="0x1" edc:name="S14C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C5" edc:desc="" edc:mask="0x1" edc:name="S15C5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA21" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA21" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S16C5" edc:desc="" edc:mask="0x1" edc:name="S16C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C5" edc:desc="" edc:mask="0x1" edc:name="S17C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C5" edc:desc="" edc:mask="0x1" edc:name="S18C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C5" edc:desc="" edc:mask="0x1" edc:name="S19C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C5" edc:desc="" edc:mask="0x1" edc:name="S20C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C5" edc:desc="" edc:mask="0x1" edc:name="S21C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C5" edc:desc="" edc:mask="0x1" edc:name="S22C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C5" edc:desc="" edc:mask="0x1" edc:name="S23C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S24C5" edc:desc="" edc:mask="0x1" edc:name="S24C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C5" edc:desc="" edc:mask="0x1" edc:name="S25C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C5" edc:desc="" edc:mask="0x1" edc:name="S26C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C5" edc:desc="" edc:mask="0x1" edc:name="S27C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C5" edc:desc="" edc:mask="0x1" edc:name="S28C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C5" edc:desc="" edc:mask="0x1" edc:name="S29C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C5" edc:desc="" edc:mask="0x1" edc:name="S30C5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C5" edc:desc="" edc:mask="0x1" edc:name="S31C5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
