balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA310.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA25" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA25" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S16C6" edc:desc="" edc:mask="0x1" edc:name="S16C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C6" edc:desc="" edc:mask="0x1" edc:name="S17C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C6" edc:desc="" edc:mask="0x1" edc:name="S18C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C6" edc:desc="" edc:mask="0x1" edc:name="S19C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C6" edc:desc="" edc:mask="0x1" edc:name="S20C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C6" edc:desc="" edc:mask="0x1" edc:name="S21C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C6" edc:desc="" edc:mask="0x1" edc:name="S22C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C6" edc:desc="" edc:mask="0x1" edc:name="S23C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S24C6" edc:desc="" edc:mask="0x1" edc:name="S24C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C6" edc:desc="" edc:mask="0x1" edc:name="S25C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C6" edc:desc="" edc:mask="0x1" edc:name="S26C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C6" edc:desc="" edc:mask="0x1" edc:name="S27C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C6" edc:desc="" edc:mask="0x1" edc:name="S28C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C6" edc:desc="" edc:mask="0x1" edc:name="S29C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C6" edc:desc="" edc:mask="0x1" edc:name="S30C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C6" edc:desc="" edc:mask="0x1" edc:name="S31C6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA26" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA26" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S32C6" edc:desc="" edc:mask="0x1" edc:name="S32C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S33C6" edc:desc="" edc:mask="0x1" edc:name="S33C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S34C6" edc:desc="" edc:mask="0x1" edc:name="S34C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S35C6" edc:desc="" edc:mask="0x1" edc:name="S35C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S36C6" edc:desc="" edc:mask="0x1" edc:name="S36C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S37C6" edc:desc="" edc:mask="0x1" edc:name="S37C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S38C6" edc:desc="" edc:mask="0x1" edc:name="S38C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S39C6" edc:desc="" edc:mask="0x1" edc:name="S39C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S40C6" edc:desc="" edc:mask="0x1" edc:name="S40C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S41C6" edc:desc="" edc:mask="0x1" edc:name="S41C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S42C6" edc:desc="" edc:mask="0x1" edc:name="S42C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S43C6" edc:desc="" edc:mask="0x1" edc:name="S43C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S44C6" edc:desc="" edc:mask="0x1" edc:name="S44C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S45C6" edc:desc="" edc:mask="0x1" edc:name="S45C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S46C6" edc:desc="" edc:mask="0x1" edc:name="S46C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S47C6" edc:desc="" edc:mask="0x1" edc:name="S47C6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA27" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA27" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S48C6" edc:desc="" edc:mask="0x1" edc:name="S48C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S49C6" edc:desc="" edc:mask="0x1" edc:name="S49C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S50C6" edc:desc="" edc:mask="0x1" edc:name="S50C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S51C6" edc:desc="" edc:mask="0x1" edc:name="S51C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S52C6" edc:desc="" edc:mask="0x1" edc:name="S52C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S53C6" edc:desc="" edc:mask="0x1" edc:name="S53C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S54C6" edc:desc="" edc:mask="0x1" edc:name="S54C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S55C6" edc:desc="" edc:mask="0x1" edc:name="S55C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S56C6" edc:desc="" edc:mask="0x1" edc:name="S56C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S57C6" edc:desc="" edc:mask="0x1" edc:name="S57C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S58C6" edc:desc="" edc:mask="0x1" edc:name="S58C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S59C6" edc:desc="" edc:mask="0x1" edc:name="S59C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S60C6" edc:desc="" edc:mask="0x1" edc:name="S60C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S61C6" edc:desc="" edc:mask="0x1" edc:name="S61C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S62C6" edc:desc="" edc:mask="0x1" edc:name="S62C6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S63C6" edc:desc="" edc:mask="0x1" edc:name="S63C6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA28" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA28" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S00C7" edc:desc="" edc:mask="0x1" edc:name="S00C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C7" edc:desc="" edc:mask="0x1" edc:name="S01C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C7" edc:desc="" edc:mask="0x1" edc:name="S02C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C7" edc:desc="" edc:mask="0x1" edc:name="S03C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C7" edc:desc="" edc:mask="0x1" edc:name="S04C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C7" edc:desc="" edc:mask="0x1" edc:name="S05C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C7" edc:desc="" edc:mask="0x1" edc:name="S06C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C7" edc:desc="" edc:mask="0x1" edc:name="S07C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S08C7" edc:desc="" edc:mask="0x1" edc:name="S08C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C7" edc:desc="" edc:mask="0x1" edc:name="S09C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C7" edc:desc="" edc:mask="0x1" edc:name="S10C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C7" edc:desc="" edc:mask="0x1" edc:name="S11C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C7" edc:desc="" edc:mask="0x1" edc:name="S12C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C7" edc:desc="" edc:mask="0x1" edc:name="S13C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C7" edc:desc="" edc:mask="0x1" edc:name="S14C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C7" edc:desc="" edc:mask="0x1" edc:name="S15C7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA29" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA29" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S16C7" edc:desc="" edc:mask="0x1" edc:name="S16C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C7" edc:desc="" edc:mask="0x1" edc:name="S17C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C7" edc:desc="" edc:mask="0x1" edc:name="S18C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C7" edc:desc="" edc:mask="0x1" edc:name="S19C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C7" edc:desc="" edc:mask="0x1" edc:name="S20C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C7" edc:desc="" edc:mask="0x1" edc:name="S21C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C7" edc:desc="" edc:mask="0x1" edc:name="S22C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C7" edc:desc="" edc:mask="0x1" edc:name="S23C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S24C7" edc:desc="" edc:mask="0x1" edc:name="S24C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C7" edc:desc="" edc:mask="0x1" edc:name="S25C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C7" edc:desc="" edc:mask="0x1" edc:name="S26C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C7" edc:desc="" edc:mask="0x1" edc:name="S27C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C7" edc:desc="" edc:mask="0x1" edc:name="S28C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C7" edc:desc="" edc:mask="0x1" edc:name="S29C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C7" edc:desc="" edc:mask="0x1" edc:name="S30C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C7" edc:desc="" edc:mask="0x1" edc:name="S31C7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA30" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA30" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S32C7" edc:desc="" edc:mask="0x1" edc:name="S32C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S33C7" edc:desc="" edc:mask="0x1" edc:name="S33C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S34C7" edc:desc="" edc:mask="0x1" edc:name="S34C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S35C7" edc:desc="" edc:mask="0x1" edc:name="S35C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S36C7" edc:desc="" edc:mask="0x1" edc:name="S36C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S37C7" edc:desc="" edc:mask="0x1" edc:name="S37C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S38C7" edc:desc="" edc:mask="0x1" edc:name="S38C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S39C7" edc:desc="" edc:mask="0x1" edc:name="S39C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S40C7" edc:desc="" edc:mask="0x1" edc:name="S40C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S41C7" edc:desc="" edc:mask="0x1" edc:name="S41C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S42C7" edc:desc="" edc:mask="0x1" edc:name="S42C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S43C7" edc:desc="" edc:mask="0x1" edc:name="S43C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S44C7" edc:desc="" edc:mask="0x1" edc:name="S44C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S45C7" edc:desc="" edc:mask="0x1" edc:name="S45C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S46C7" edc:desc="" edc:mask="0x1" edc:name="S46C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S47C7" edc:desc="" edc:mask="0x1" edc:name="S47C7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA31" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA31" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S48C7" edc:desc="" edc:mask="0x1" edc:name="S48C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S49C7" edc:desc="" edc:mask="0x1" edc:name="S49C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S50C7" edc:desc="" edc:mask="0x1" edc:name="S50C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S51C7" edc:desc="" edc:mask="0x1" edc:name="S51C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S52C7" edc:desc="" edc:mask="0x1" edc:name="S52C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S53C7" edc:desc="" edc:mask="0x1" edc:name="S53C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S54C7" edc:desc="" edc:mask="0x1" edc:name="S54C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S55C7" edc:desc="" edc:mask="0x1" edc:name="S55C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S56C7" edc:desc="" edc:mask="0x1" edc:name="S56C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S57C7" edc:desc="" edc:mask="0x1" edc:name="S57C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S58C7" edc:desc="" edc:mask="0x1" edc:name="S58C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S59C7" edc:desc="" edc:mask="0x1" edc:name="S59C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S60C7" edc:desc="" edc:mask="0x1" edc:name="S60C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S61C7" edc:desc="" edc:mask="0x1" edc:name="S61C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S62C7" edc:desc="" edc:mask="0x1" edc:name="S62C7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S63C7" edc:desc="" edc:mask="0x1" edc:name="S63C7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="48"/>
        <edc:SFRDef edc:access="n-nnn-nnnnnn-nnn" edc:cname="PMCON1" edc:desc="" edc:impl="0xbbf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000-000000-000" edc:name="PMCON1" edc:nzwidth="16" edc:por="0-000-000000-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IRQM" edc:desc="" edc:mask="0x3" edc:name="IRQM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="BUSKEEP" edc:desc="" edc:mask="0x1" edc:name="BUSKEEP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ALMODE" edc:desc="" edc:mask="0x1" edc:name="ALMODE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ALP" edc:desc="" edc:mask="0x1" edc:name="ALP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSF" edc:desc="" edc:mask="0x3" edc:name="CSF" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADRMUX" edc:desc="" edc:mask="0x3" edc:name="ADRMUX" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSIDL" edc:desc="" edc:mask="0x1" edc:name="PSIDL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PMPEN" edc:desc="" edc:mask="0x1" edc:name="PMPEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IRQM0" edc:desc="" edc:mask="0x1" edc:name="IRQM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQM1" edc:desc="" edc:mask="0x1" edc:name="IRQM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CSF0" edc:desc="" edc:mask="0x1" edc:name="CSF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSF1" edc:desc="" edc:mask="0x1" edc:name="CSF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADRMUX0" edc:desc="" edc:mask="0x1" edc:name="ADRMUX0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRMUX1" edc:desc="" edc:mask="0x1" edc:name="ADRMUX1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
