balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA310.PIC
    <edc:Pin>
      <!--Pin 83-->
      <edc:VirtualPin edc:name="C3INB"/>
      <edc:VirtualPin edc:name="SEG25"/>
      <edc:VirtualPin edc:name="PMD14"/>
      <edc:VirtualPin edc:name="CN15"/>
      <edc:VirtualPin edc:name="RD6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 84-->
      <edc:VirtualPin edc:name="C3INA"/>
      <edc:VirtualPin edc:name="SEG26"/>
      <edc:VirtualPin edc:name="PMD15"/>
      <edc:VirtualPin edc:name="CN16"/>
      <edc:VirtualPin edc:name="RD7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 85-->
      <edc:VirtualPin edc:name="VCAP"/>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 86-->
      <edc:VirtualPin edc:name="VBAT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 87-->
      <edc:VirtualPin edc:name="SEG27"/>
      <edc:VirtualPin edc:name="PMD11"/>
      <edc:VirtualPin edc:name="CN68"/>
      <edc:VirtualPin edc:name="RF0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 88-->
      <edc:VirtualPin edc:name="COM4"/>
      <edc:VirtualPin edc:name="SEG48"/>
      <edc:VirtualPin edc:name="PMD10"/>
      <edc:VirtualPin edc:name="CN69"/>
      <edc:VirtualPin edc:name="RF1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 89-->
      <edc:VirtualPin edc:name="SEG46"/>
      <edc:VirtualPin edc:name="PMD9"/>
      <edc:VirtualPin edc:name="CN78"/>
      <edc:VirtualPin edc:name="RG1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 90-->
      <edc:VirtualPin edc:name="SEG50"/>
      <edc:VirtualPin edc:name="PMD8"/>
      <edc:VirtualPin edc:name="CN77"/>
      <edc:VirtualPin edc:name="RG0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 91-->
      <edc:VirtualPin edc:name="AN23"/>
      <edc:VirtualPin edc:name="SEG58"/>
      <edc:VirtualPin edc:name="CN39"/>
      <edc:VirtualPin edc:name="RA6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 92-->
      <edc:VirtualPin edc:name="AN22"/>
      <edc:VirtualPin edc:name="SEG59"/>
      <edc:VirtualPin edc:name="PMA17"/>
      <edc:VirtualPin edc:name="CN40"/>
      <edc:VirtualPin edc:name="RA7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 93-->
      <edc:VirtualPin edc:name="COM3"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="CN58"/>
      <edc:VirtualPin edc:name="RE0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 94-->
      <edc:VirtualPin edc:name="COM2"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="CN59"/>
      <edc:VirtualPin edc:name="RE1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 95-->
      <edc:VirtualPin edc:name="SEG60"/>
      <edc:VirtualPin edc:name="PMA16"/>
      <edc:VirtualPin edc:name="CTED11"/>
      <edc:VirtualPin edc:name="CN81"/>
      <edc:VirtualPin edc:name="RG14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 96-->
      <edc:VirtualPin edc:name="SEG61"/>
      <edc:VirtualPin edc:name="CN79"/>
      <edc:VirtualPin edc:name="RG12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 97-->
      <edc:VirtualPin edc:name="SEG62"/>
      <edc:VirtualPin edc:name="CTED10"/>
      <edc:VirtualPin edc:name="CN80"/>
      <edc:VirtualPin edc:name="RG13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 98-->
      <edc:VirtualPin edc:name="COM1"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="CN60"/>
      <edc:VirtualPin edc:name="RE2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 99-->
      <edc:VirtualPin edc:name="COM0"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="CTED9"/>
      <edc:VirtualPin edc:name="CN61"/>
      <edc:VirtualPin edc:name="RE3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 100-->
      <edc:VirtualPin edc:name="SEG63"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="CTED8"/>
      <edc:VirtualPin edc:name="CN62"/>
      <edc:VirtualPin edc:name="RE4"/>
    </edc:Pin>
  <!--remappable inputs-->
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="MDMIN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="MDCIN1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="MDCIN2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T1CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T2CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T3CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T4CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T5CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFA"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFB"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1CTS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2CTS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3CTS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4CTS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SCK1IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS1IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SCK2IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS2IN"/>
    </edc:RemappablePin>
    <!--remappable outputs-->
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1TX" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1RTS" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2TX" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2RTS" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SCK1OUT" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS1OUT" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SCK2OUT" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS2OUT" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC1" edc:ppsval="18"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC2" edc:ppsval="19"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC3" edc:ppsval="20"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC4" edc:ppsval="21"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC5" edc:ppsval="22"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC6" edc:ppsval="23"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC7" edc:ppsval="24"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3TX" edc:ppsval="28"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3RTS" edc:ppsval="29"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4TX" edc:ppsval="30"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4RTS" edc:ppsval="31"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C3OUT" edc:ppsval="36"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="MDOUT" edc:ppsval="37"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>